<script setup>
import { ref } from 'vue'

const list = ref([
  '活動時間為:【2022年5月17日起至上市前】',
  '上市時間再請關注官方粉絲團及GPG官網。',
  '預約人數統計為每十二小時一次，敬請耐心等候',
  '一組手機號碼僅能進行乙次登錄活動。',
  '獎勵序號將於遊戲上市後透過手機簡訊通知。',
  '在參加本活動之同時,参加者即受到本活動注意事項之規範，所有破壞活動之行為及違法行為，主辦單位保留法律追訴權。',
  '贈送的遊戲道具依遊戲內實際說明為準。',
  '實體獎勵於遊戲上市當天23:59:59(GTM+8)截止後進行抽獎。',
  '實體獎勵中獎通知日期請關注GPG神遊平台官網、Facebook 粉絲專頁、Twitter、Line客服。將於公告中說明領獎辦法與領取時間，若逾期領獎視同放棄，恕不補發。',
  '玩家如果因個人線路不穩,導致資料錯誤、不完整等問題，本公司一概不負任何責任,活動亦照常舉行且不另做其他補償。',
  '本活動之所有物品均不得要求官方轉換、轉讓、折換現或戲道具、貨幣。',
  '若您無法進行事前登錄,還請至GPG神遊平台、Line客服或FB官方粉絲團進詢問。',
  '活動相關規定以官方網站公告為主，GPG保有最終活動解釋修改權利。',
])
</script>

<template lang="pug">
.reserve__wrap
  .reserve__container
    .reserve__title 事前預約
    .reserve__list
      .reserve__item(
        v-for="(item, index) of list"
        :key="index"
      ) {{ item }}
</template>